Revit 2024 API
AdaptiveComponentFamilyUtils Members
The AdaptiveComponentFamilyUtils type exposes the following members.
Methods
Name | Description
GetNumberOfAdaptivePoints
 Gets number of Adaptive Point Elements in Adaptive Component Family.
GetNumberOfPlacementPoints
 Gets number of Placement Point Elements in Adaptive Component Family.
GetNumberOfShapeHandlePoints
 Gets number of Shape Handle Point Elements in Adaptive Component Family.
GetPlacementNumber
 Gets Placement number of an Adaptive Placement Point.
GetPointConstraintType
 Gets constrain type of an Adaptive Shape Handle Point.
GetPointOrientationType
 Gets orientation type of an Adaptive Placement Point.
IsAdaptiveComponentFamily
 Verifies if the Family is an Adaptive Component Family.
IsAdaptivePlacementPoint
 Verifies if the Reference Point is an Adaptive Placement Point.
IsAdaptivePoint
 Verifies if the Reference Point is an Adaptive Point.
IsAdaptiveShapeHandlePoint
 Verifies if the Reference Point is an Adaptive Shape Handle Point.
MakeAdaptivePoint
 Makes Reference Point an Adaptive Point or makes an Adaptive Point a Reference Point.
SetPlacementNumber
 Sets Placement Number of an Adaptive Placement Point.
SetPointConstraintType
 Sets constrain type of an Adaptive Shape Handle Point.
SetPointOrientationType
 Sets orientation type of an Adaptive Placement Point.
See Also
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace